In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

# NBA 데이터 가져오기

In [2]:
%pwd

'C:\\python\\2023.03.08_pandas3'

In [3]:
nba = pd.read_csv("C:/python/datas/nba.csv", parse_dates = ["Birthday"])
nba

               Name                 Team Position   Birthday    Salary
0      Shake Milton   Philadelphia 76ers       SG 1996-09-26   1445697
1    Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
2     PJ Washington    Charlotte Hornets       PF 1998-08-23   3831840
3      Derrick Rose      Detroit Pistons       PG 1988-10-04   7317074
4     Marial Shayok   Philadelphia 76ers        G 1995-07-26     79568
..              ...                  ...      ...        ...       ...
445   Austin Rivers      Houston Rockets       PG 1992-08-01   2174310
446     Harry Giles     Sacramento Kings       PF 1998-04-22   2578800
447     Robin Lopez      Milwaukee Bucks        C 1988-04-01   4767000
448   Collin Sexton  Cleveland Cavaliers       PG 1999-01-04   4764960
449     Ricky Rubio         Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 5 columns]

In [4]:
nba.dtypes # 각 컬럼의 데이터 타입 조회

Name                object
Team                object
Position            object
Birthday    datetime64[ns]
Salary               int64
dtype: object

In [5]:
nba.dtypes.value_counts() # 조회된 데이터 타입의 개수 카운트

object            3
datetime64[ns]    1
int64             1
dtype: int64

In [6]:
nba.ndim # 데이터 차원수 조회

2

In [7]:
nba.shape # 데이터 모양 조회

(450, 5)

In [8]:
nba.columns # 컬럼 인덱스 조회

Index(['Name', 'Team', 'Position', 'Birthday', 'Salary'], dtype='object')

In [9]:
nba.index # 로우 인덱스 조회

RangeIndex(start=0, stop=450, step=1)

In [10]:
len(nba) - nba.count() # 결측치 개수 확인

Name        0
Team        0
Position    0
Birthday    0
Salary      0
dtype: int64

In [11]:
nba.count()

Name        450
Team        450
Position    450
Birthday    450
Salary      450
dtype: int64

In [12]:
nba.count().sum() # 전체 모든 데이터의 개수

2250

In [13]:
nba.nunique() # 각 컬럽별 고유한 값 개수 조회

Name        450
Team         30
Position      9
Birthday    430
Salary      269
dtype: int64

In [14]:
nba.max() # 각 컬러마다 가장 큰 값

Name             Zylan Cheatham
Team         Washington Wizards
Position                     SG
Birthday    2000-12-23 00:00:00
Salary                 40231758
dtype: object

In [15]:
nba.min() # 각 컬러마다 가장 작은 값

Name               Aaron Gordon
Team              Atlanta Hawks
Position                      C
Birthday    1977-01-26 00:00:00
Salary                    79568
dtype: object

In [16]:
nba.nlargest(5, columns = ["Salary"])
# Salary 열에 대해서 상위 5개 출력

                  Name                   Team Position   Birthday    Salary
205      Stephen Curry  Golden State Warriors       PG 1988-03-14  40231758
38          Chris Paul  Oklahoma City Thunder       PG 1985-05-06  38506482
219  Russell Westbrook        Houston Rockets       PG 1988-11-12  38506482
251          John Wall     Washington Wizards       PG 1990-09-06  38199000
264       James Harden        Houston Rockets       PG 1989-08-26  38199000

In [17]:
nba.nsmallest(5,
             columns = ["Birthday"])

               Name               Team Position   Birthday    Salary
98     Vince Carter      Atlanta Hawks       PF 1977-01-26   2564753
196   Udonis Haslem         Miami Heat        C 1980-06-09   2564753
262     Kyle Korver    Milwaukee Bucks       PF 1981-03-17   6004753
149  Tyson Chandler    Houston Rockets        C 1982-10-02   2564753
415  Andre Iguodala  Memphis Grizzlies       SF 1984-01-28  17185185

In [18]:
nba.sum(numeric_only = True)

Salary    3444112694
dtype: int64

In [19]:
nba.mean(numeric_only = True)

Salary    7.653584e+06
dtype: float64

In [20]:
nba.median(numeric_only = True)

Salary    3303074.5
dtype: float64

In [21]:
nba.std(numeric_only = True)

Salary    9.288810e+06
dtype: float64

In [22]:
titanic = sns.load_dataset("titanic")
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [23]:
titanic["sex"].value_counts().sort_values(ascending = False)

male      577
female    314
Name: sex, dtype: int64

In [24]:
titanic["age"].value_counts().sort_values(ascending = False)

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
66.00     1
0.67      1
0.42      1
34.50     1
74.00     1
Name: age, Length: 88, dtype: int64

In [25]:
titanic["class"].value_counts().sort_values(ascending = False)

Third     491
First     216
Second    184
Name: class, dtype: int64

In [26]:
titanic["alive"].value_counts().sort_values(ascending = False)

no     549
yes    342
Name: alive, dtype: int64

In [27]:
print(f"""{titanic["sex"].value_counts().sort_values(ascending = False)}

{titanic["age"].value_counts().sort_values(ascending = False)}

{titanic["class"].value_counts().sort_values(ascending = False)}

{titanic["alive"].value_counts().sort_values(ascending = False)}
"""
       )

male      577
female    314
Name: sex, dtype: int64

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
66.00     1
0.67      1
0.42      1
34.50     1
74.00     1
Name: age, Length: 88, dtype: int64

Third     491
First     216
Second    184
Name: class, dtype: int64

no     549
yes    342
Name: alive, dtype: int64

In [28]:
# 1) 타이타닉호 승객의 평균 나이를 구하세요.
print(round(titanic["age"].mean(), 1), end = "\n\n")

# 2) 타이타닉호 승객중 여성 승객의 평균 나이를 구하세요.
print(round(titanic[titanic["sex"] == "female"]["age"].mean(), 1), end = "\n\n")

# 3) 타이타닉호 승객중 1등실(pclass == 1) 선실의 여성 승객의 평균 나이를 구하세요.
print(round(titanic[(titanic["sex"] == "female") 
                    & (titanic["pclass"] == 1)]["age"].mean(), 1))

29.7

27.9

34.6

In [29]:
titanic.T.loc["age"].mean().round(1)

29.7

In [30]:
titanic.T.loc["sex"] == "female" # 여자 boolean indexing

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888     True
889    False
890    False
Name: sex, Length: 891, dtype: bool

In [31]:
round(titanic.loc[titanic.T.loc["sex"] == "female"]["age"].mean(), 1)
# 성별이 여자인 사람들의 평균나이

27.9

In [32]:
round(titanic.loc[(titanic.T.loc["sex"] == "female") & (titanic.T.loc["pclass"] == 1)]["age"].mean(), 1)
# 1등 객실이면서 성별이 여자인 사람의 나이 평균

34.6